# Core CLI / developer tools
brew "git"
brew "gh"
brew "python"
brew "node"
brew "tmux"
brew "ripgrep"
brew "fd"
brew "jq"
brew "wget"
brew "tree"
brew "fzf"
brew "bat"
brew "eza"
brew "zoxide"
brew "watch"
brew "uv"
brew "just"

# Containers
brew "colima"
brew "docker"
brew "docker-compose"

# App Store CLI helper
brew "mas"

# GUI apps
cask "visual-studio-code"
cask "iterm2"
cask "rectangle"
cask "raycast"
cask "google-chrome"
cask "bitwarden"
cask "anydesk"
cask "chatgpt"
cask "codex"
cask "synology-drive"
cask "stats"

# App Store examples - uncomment after signing into the App Store
# mas "Xcode", id: 497799835
# mas "Slack", id: 803453959
